from ast import Str
from typing import OrderedDict




def ყიდვა(ფასები):
    if ყიდვა == int:
        ფასები == str + "ფასი"
        print(int*ფასები["str + ფასი"], "ლარი")
    return





my_food =  { "ხინკალი" : ["ქალაქური 1.50 ლარი", "მთიული 1.20 ლარი", "დაკეპილი 2 ლარი", "ყველიანი 1 ლარი"],
             "მწვადი" : ["დიდი (8 ცალი) 20 ლარი", "საშუალო (6 ცალი) 15 ლარი", "პატარა(4 ცალი) 10 ლარი"],
             "ქაბაბი" : ["დიდი 20 ლარი", "პატარა 10 ლარი", "საშუალო 15 ლარი"],
             "უალკოჰოლო-სასმელი" : ["კოკა-კოლა 5 ლარი", "პეპსი 5 ლარი", "ლიმონათი ნატახტარი (ყველანაირი) 5 ლარი" "ნატურალური წვენი 10 ლარი"],
             "ალკოჰოლური-სასმელები" : ["ლუდი 20 ლარი", "ღვინო 50 ლარი", "არაყი 60 ლარი"]
}
              
ფასები =     {"ხინკალი ქალაქური ფასი" : 1.50,
             "ხინკალი მთიული ფასი" : 1.20,
             "ხინკალი დაკეპილი ფასი" : 2,
             "ხინკალი ყველიანი ფასი" : 1,
             "მწვადი დიდი ფასი" : 20,
             "მწვადი საშუალო ფასი" : 15,
             "მწვადი პატარა ფასი" : 10,
             "ქაბაბი დიდი ფასი" : 20,
             "ქაბაბი დიდი ფასი" : 20,
             "ქაბაბი პატარა ფასი" : 15,
             "ქაბაბი საშუალო ფასი" : 15, 
             "უალკოჰოლო-სასმელები : კოკა-კოლა" : 5,
             "უალკოჰოლო-სასმელები : პეპსი" : 6,
             "უალკოჰოლო-სასმელები : ლიმონათი ნატახტარი (ყველანაირი) 5 ლარი" : 5,
             "უალკოჰოლო-სასმელები : ნატურალური წვენი" : 10,
             "ალკოჰოლური-სასმელები : ლუდი" : 20,
             "ალკოჰოლური-სასმელები : ღვინო" : 50 , 
             "ალკოჰოლური-სასმელები : არაყი" : 60
 
 }





print("მოგესალმებით სახინკლეში სახელად 'მაჭახელა'")
print("რას მიირთვმევთ დღეს?")
 
Ordered_print:print("მენიუ :"   "ხინკალი :" "ქალაქური 1.50 ლარი", "მთიული 1.20 ლარი", "დაკეპილი 2 ლარი", "ყველიანი 1 ლარი",
                  
                    "მწვადი :" "დიდი (8 ცალი) 20 ლარი", "საშუალო (6 ცალი) 15 ლარი", "პატარა(4 ცალი) 10 ლარი",
                  
                    "ქაბაბი :" "დიდი 20 ლარი", "პატარა 10 ლარი", "საშუალო 15 ლარი",
                  
                    "უალკოჰოლო-სასმელი :" "კოკა-კოლა 5 ლარი", "პეპსი 5 ლარი", "ლიმონათი ნატახტარი (ყველანაირი) 5 ლარი" "ნატურალური წვენი 10 ლარი",
                  
                    "ალკოჰოლური-სასმელები :" "ლუდი 20 ალრი", "ღვინო 50 ლარი", "არაყი 60 ლარი")








print("თქვენ მიერ არჩეული საჭმელი მიუთითეთ ქვემოთა ჩარჩოში")
input("რაოდენობა : ", int(""))
input("პროდუქტი : ", str(""))















       










