def myfunction_2(v, s, n):
            print(n[v] * s)




def mybest(a, b, c, d, e):
    while a == "კი" or "დიახ":
        print("თქვენ მიერ არჩეული საკვები ჩაწერეთ ქვედა ჩარჩოში")
        b = input("")
        print(b,"ს რაოდენობა ჩაწერეთ ქვედა ჩარჩოში")
        c = int(input(""))
        print("თქვენი გადასახადია")
        myfunction_2(c, d, e)
        print("ლარი")
        print("კიდევ რამე ხომ არ გნებავთ")
        a = input("")
        b =+ 1
        c =+ 1

        

საკვები = {"ლობიანი", "ხაჭაპური"}
ფასები = {"ლობიანი": 5,
          "ხაჭაპური" : 7}

