# numbers = []
# for i in range(100): 
#     numbers.append(i)





# mylist = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]

# def mylen(numbers):
#     n = 0
#     for i in numbers:
#         n = n + 1
#     return n

# y = mylen(numbers)
# print(y)
# print(len(numbers))
ტკბილეულობა = ["ნაყინი", "შოკოლადი", "ნამცცვარი"]

ფასები = {"ნაყინი" : 1,
          "შოკოლადი" : 2,
          "ნამცხვარი" : 1
         }




print("გამარჯობა")
print("რისი ყიდვა გნებავთ")
print("თქვენ მიერ არჩეული სასუსნავი ჩაწერეთ ქვედა ჩარჩოში")
print("სასუსნავი :")
სასუსნავი = input("")
print("რაოდენობა :")
რაოდენობა = int(input(""))

საბოლოო_ფასი = ფასები[სასუსნავი] * რაოდენობა






if  სასუსნავი in ტკბილეულობა:
    print("თქვენ მიერ არჩეული პროდუქტი გვაქვს შეიძენთ")
    yes_or_no = input("")

else:
    სასუსნავი in ტკბილეულობა == False
    print("სამწუხაროთ", სასუსნავი, "არ გვაქვს")
    კი_ან_არა = input("სხვა ტკბილეულობა ხომ არ გნებავთ")
    

if yes_or_no == "დიახ":
    print("თქვენი გადასახადია: ", )
    print(საბოლოო_ფასი)
    print("შეიძენთ?")
    yes_or_no_2 = input("")
else:
    yes_or_no == "არა გმადლობთ" or "არა"
    კი_ან_არა_2 = input("სხვა ტკბილეულს ხომ არ შეძენთ")


if კი_ან_არა == "კი":
    print("თქვენ მიერ არჩეული ტკბილეული ჩაწერეთ ქვედა ჩარჩოში")
    print("სასუსნავი")
    სასუსნავი = input("")
    print("რაოდენობა")
    რაოდენობა = input()
else:
    კი_ან_არა == "არა"
    print("გასაგებია, ნახვამდის!")


if yes_or_no_2 == "დიახ" or "კი":
    print("შეძენა წარმატებით დასრულდა იმედია ისიამოვნეთ ჩვენი მომსახურებით")
else:
    yes_or_no_2 == "არა" or "არა გმადლობთ"
    over = input("კარგით, სხვა ტკბილეულობის შეძენა ხომ არ გნებავთ?")

if over == "დიახ":
    print("თქვენ მიერ არჩეული ტკბილეული ჩაწერეთ ქვედა ჩარჩოში")
    print("სასუსნავი")
    სასუსნავი = input("")
    print("რაოდენობა")
    რაოდენობა = int(input())
else:
    over == "არა", "არა გმადლობთ"
    print("ნახვამდის!")
 









    



